name: "Zeiler_conv5"

input: "data1"
input_dim: 1
input_dim: 384
input_dim: 28
input_dim: 28

input: "data2"
input_dim: 1
input_dim: 384
input_dim: 28
input_dim: 28

input: "data3"
input_dim: 1
input_dim: 256
input_dim: 28
input_dim: 28

input: "rois"
input_dim: 1 # to be changed on-the-fly to num ROIs
input_dim: 5 # [batch ind, x1, y1, x2, y2] zero-based indexing
input_dim: 1
input_dim: 1

#=========== roi layers ==========
layer {
        bottom: "data1"
        bottom: "rois"
        top: "roi_pool3"
        name: "roi_pool3"
        type: "ROIPooling"
        roi_pooling_param {
                pooled_w: 6
                pooled_h: 6
                spatial_scale: 0.125  # (1/8)
        }
}


layer {
        bottom: "data2"
        bottom: "rois"
        top: "roi_pool4"
        name: "roi_pool4"
        type: "ROIPooling"
        roi_pooling_param {
                pooled_w: 6
                pooled_h: 6
                spatial_scale: 0.125  # (1/8)
        }
}

layer {
        bottom: "data3"
        bottom: "rois"
        top: "roi_pool5"
        name: "roi_pool5"
        type: "ROIPooling"
        roi_pooling_param {
                pooled_w: 6
                pooled_h: 6
                spatial_scale: 0.125  # (1/8)
        }
}

layer {
        bottom: "roi_pool3"
        top: "roi_pool3_flat"
        name: "roi_pool3_flat"
        type: "Flatten"
}

layer {
        bottom: "roi_pool4"
        top: "roi_pool4_flat"
        name: "roi_pool4_flat"
        type: "Flatten"
}

layer {
        bottom: "roi_pool5"
        top: "roi_pool5_flat"
        name: "roi_pool5_flat"
        type: "Flatten"
}

layer {
        bottom: "roi_pool3_flat"
        bottom: "roi_pool4_flat"
        bottom: "roi_pool5_flat"
        top: "concat_feat"
        name: "concat_feat"
        type: "Concat"
}















