name: "ZF_v1"

input: "data"
input_dim: 1
input_dim: 3
input_dim: 224
input_dim: 224

input: "rois"
input_dim: 1 # to be changed on-the-fly to num ROIs
input_dim: 5 # [batch ind, x1, y1, x2, y2] zero-based indexing
input_dim: 1
input_dim: 1

layer {
        name: "conv1"
        type: "Convolution"
        bottom: "data"
        top: "conv1"
        param {
                lr_mult: 0.0
        }
        param {
                lr_mult: 0.0
        }
        convolution_param {
                num_output: 96
                kernel_size: 7
                pad: 3
                stride: 2
        }
}

layer {
        name: "relu1"
        type: "ReLU"
        bottom: "conv1"
        top: "conv1"
}

layer {
        name: "norm1"
        type: "LRN"
        bottom: "conv1"
        top: "norm1"
        lrn_param {
                local_size: 3
                alpha: 0.00005
                beta: 0.75
                norm_region: WITHIN_CHANNEL
        }
}

layer {
        name: "pool1"
        type: "Pooling"
        bottom: "norm1"
        top: "pool1"
        pooling_param {
                kernel_size: 3
                stride: 2
                pad: 1
                pool: MAX
        }
}

layer {
        name: "conv2"
        type: "Convolution"
        bottom: "pool1"
        top: "conv2"
        param {
                lr_mult: 0.0
        }
        param {
                lr_mult: 0.0
        }
        convolution_param {
                num_output: 256
                kernel_size: 5
                pad: 2
                stride: 2
    	}
}


layer {
        name: "relu2"
        type: "ReLU"
        bottom: "conv2"
        top: "conv2"
}

layer {
        name: "norm2"
        type: "LRN"
        bottom: "conv2"
        top: "norm2"
        lrn_param {
                local_size: 3
                alpha: 0.00005
                beta: 0.75
                norm_region: WITHIN_CHANNEL
        }
}

layer {
        name: "pool2_atrous"
        type: "Pooling"
        bottom: "norm2"
        top: "pool2_atrous"
        pooling_param {
                kernel_size: 3
                stride: 1
                pad: 1
                pool: MAX
        }
}

layer {
        name: "conv3"
        type: "Convolution"
        bottom: "pool2_atrous"
        top: "conv3"
        param {
                lr_mult: 1.0
        }
        param {
                lr_mult: 2.0
        }
        convolution_param {
                num_output: 384
                kernel_size: 3
                pad: 1
                filter_stride: 2
        }
}

layer {
        name: "relu3"
        type: "ReLU"
        bottom: "conv3"
        top: "conv3"
}

layer {
        name: "conv4"
        type: "Convolution"
        bottom: "conv3"
        top: "conv4"
        param {
                lr_mult: 1.0
        }
        param {
                lr_mult: 2.0
        }
        convolution_param {
                num_output: 384
                kernel_size: 3
                pad: 1
                filter_stride: 2
        }
}

layer {
        name: "relu4"
        type: "ReLU"
        bottom: "conv4"
        top: "conv4"
}

layer {
        name: "conv5"
        type: "Convolution"
        bottom: "conv4"
        top: "conv5"
        param {
                lr_mult: 1.0
        }
        param {
                lr_mult: 2.0
        }
        convolution_param {
                num_output: 256
                kernel_size: 3
                pad: 1
                filter_stride: 2
        }
}

layer {
        name: "relu5"
        type: "ReLU"
        bottom: "conv5"
        top: "conv5"
}


#=========== roi layers ==========
layer {
        bottom: "conv3"
        bottom: "rois"
        top: "roi_pool3"
        name: "roi_pool3"
        type: "ROIPooling"
        roi_pooling_param {
                pooled_w: 6
                pooled_h: 6
                spatial_scale: 0.125  # (1/8)
        }
}


layer {
        bottom: "conv4"
        bottom: "rois"
        top: "roi_pool4"
        name: "roi_pool4"
        type: "ROIPooling"
        roi_pooling_param {
                pooled_w: 6
                pooled_h: 6
                spatial_scale: 0.125  # (1/8)
        }
}

layer {
        bottom: "conv5"
        bottom: "rois"
        top: "roi_pool5"
        name: "roi_pool5"
        type: "ROIPooling"
        roi_pooling_param {
                pooled_w: 6
                pooled_h: 6
                spatial_scale: 0.125  # (1/8)
        }
}

layer {
        bottom: "roi_pool3"
        top: "roi_pool3_flat"
        name: "roi_pool3_flat"
        type: "Flatten"
} 

layer {
   	bottom: "roi_pool4"
        top: "roi_pool4_flat"
        name: "roi_pool4_flat"
        type: "Flatten"
}

layer {
    	bottom: "roi_pool5"
        top: "roi_pool5_flat"
        name: "roi_pool5_flat"
        type: "Flatten"
}

layer {
	bottom: "roi_pool3_flat"
    	bottom: "roi_pool4_flat"
        bottom: "roi_pool5_flat"
        top: "concat_feat"
        name: "concat_feat"
        type: "Concat"
}














